In [1]:
import pandas as pd
from datetime import date, timedelta
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:@localhost:3306/portfolio_development')
conpf = engine.connect()

engine = create_engine("mysql+pymysql://root:@localhost:3306/stock")
const = engine.connect()

engine = create_engine("sqlite:///c:\\ruby\\port_lite\\db\\development.sqlite3")
conlite = engine.connect()

today = date.today()
today

datetime.date(2021, 12, 30)

### Sell transactions

In [2]:
sql = '''
SELECT S.* , B.net AS cost, B.qty, T.name
FROM sells S
JOIN buys B
ON buy_id = B.id
JOIN stocks T
ON B.stock_id = T.id
WHERE S.date = '%s'
ORDER BY T.name
'''
sql = sql % today
sells = pd.read_sql(sql, conpf)
sells

,id,buy_id,date,price,fee,vat,net,days,profit,percent,yearly,sequence,chart,dividend_id,cost,qty,name
0,892,1087,2021-12-30,12.60,78.25,5.48,37716.27,22,4643.18,14.03915,232.92226,108,None,0,33073.09,3000,IMH
1,893,855,2021-12-30,58.75,121.61,8.51,58619.88,269,-8277.96,-12.37403,-16.79004,107,None,0,66897.84,1000,PTTGC
2,894,986,2021-12-30,38.50,358.63,25.10,172866.27,139,3742.51,2.21288,5.81080,106,None,0,169123.76,4500,VNT

In [3]:
sql = '''
SELECT S.* , B.net AS cost, B.qty, T.name
FROM sells S
JOIN buys B
ON buy_id = B.id
JOIN stocks T
ON B.stock_id = T.id
WHERE S.date = '%s' AND T.name = "VNT"
ORDER BY T.name
'''
sql = sql % today
sells = pd.read_sql(sql, conpf)
sells

,id,buy_id,date,price,fee,vat,net,days,profit,percent,yearly,sequence,chart,dividend_id,cost,qty,name
0,894,986,2021-12-30,38.5,358.63,25.1,172866.27,139,3742.51,2.21288,5.8108,106,None,0,169123.76,4500,VNT

In [4]:
grouped = sells.groupby('name').agg(
{'qty':'sum',
 'price':'mean',
 'net':'sum',
 'cost':'sum',
 'profit':'sum'})
grouped

       qty  price        net       cost   profit
name
VNT   4500   38.5  172866.27  169123.76  3742.51

In [5]:
grouped.net.sum()

172866.27

In [6]:
trans_qty = grouped.qty.sum() * -1
trans_qty

-4500

In [7]:
names = sells['name']
in_p = ", ".join(map(lambda name: "'%s'" % name, names))
in_p

"'VNT'"

In [11]:
sql = """
SELECT * 
FROM buy 
WHERE name IN (%s) 
ORDER BY name
"""
sql = sql % in_p
df = pd.read_sql(sql, const)
df

,name,date,volbuy,price,volsell,volbal,active,dividend,period,grade
0,VNT,2021-08-13,0.0,37.5,0.0,0.0,1,0.9,4,A2

In [9]:
sqlUpd = '''
UPDATE buy
SET volbuy = volbuy + %s
WHERE name IN (%s)'''
sqlUpd = sqlUpd % (trans_qty, in_p)
print(sqlUpd)

UPDATE buy
SET volbuy = volbuy + -4500
WHERE name IN ('VNT')

In [10]:
rp = const.execute(sqlUpd)
rp.rowcount

1

### Buys transactions

In [47]:
sql = '''
SELECT B.*, T.name
FROM buys B
JOIN stocks T
ON B.stock_id = T.id
WHERE B.date = '%s'
ORDER BY T.name
'''
sql = sql % today
buys = pd.read_sql(sql, conpf)
buys

,id,stock_id,date,qty,price,fee,vat,status,net,kind,chart,name
0,1086,96,2021-12-28,3000,45.25,281.0,19.67,Active,136050.67,HD,None,RATCH

In [48]:
grouped = buys.groupby('name').agg(
{'qty':'sum',
 'price':'mean',
 'net':'sum'})
grouped

        qty  price        net
name
RATCH  3000  45.25  136050.67

In [27]:
names = buys.name.unique()
in_p = ", ".join(map(lambda name: "'%s'" % name, names))
in_p

"'RATCH'"

In [49]:
trans_qty = grouped.qty.sum()
trans_qty

3000

In [50]:
new_cost = 45.75
sqlUpd = '''
UPDATE buy
SET volbuy = volbuy + %s, price = %s
WHERE name IN (%s)'''
sqlUpd = sqlUpd % (trans_qty, new_cost, in_p)
print(sqlUpd)

UPDATE buy
SET volbuy = volbuy + 3000, price = 45.75
WHERE name IN ('KCE')

In [18]:
rp = const.execute(sqlUpd)
rp.rowcount

1

### Update table dividend in stock database for sells transactions

In [19]:
sql = """
SELECT * 
FROM dividend 
WHERE name IN (%s) 
ORDER BY name
"""
sql = sql % in_p
print(sql)

SELECT *
FROM dividend
WHERE name IN ('PTTGC')
ORDER BY name

In [23]:
df = pd.read_sql(sql, const)
df

,NAME,Q4,Q3,Q2,Q1,DIVIDEND,PRICE,PERCENT,SHARES,XDATE,PAIDDATE,KIND,ACTUAL
0,PTTGC,1.0,0.0,2.0,0.0,3.0,0.0,0.0,4400.0,2021-09-03,2021-09-22,None,0

In [21]:
sqlUpd = '''
UPDATE dividend
SET shares = shares + %s
WHERE name IN (%s)'''
sqlUpd = sqlUpd % (trans_qty, in_p)
print(sqlUpd)

UPDATE dividend
SET shares = shares + -1000
WHERE name IN ('PTTGC')

In [22]:
rp = const.execute(sqlUpd)
rp.rowcount

1

### Update table dividend in stock database for buys transactions

In [53]:
sql = """
SELECT * 
FROM dividend 
WHERE name IN (%s) 
ORDER BY name
"""
sql = sql % in_p
df = pd.read_sql(sql, const)
df

,NAME,Q4,Q3,Q2,Q1,DIVIDEND,PRICE,PERCENT,SHARES,XDATE,PAIDDATE,KIND,ACTUAL
0,KCE,0.4,0.0,0.6,0.0,1.0,0.0,0.0,4000.0,2021-08-23,2021-09-08,,0

In [54]:
sqlUpd = '''
UPDATE dividend
SET shares = shares + %s
WHERE name IN (%s)'''
sqlUpd = sqlUpd % (trans_qty, in_p)
print(sqlUpd)

UPDATE dividend
SET shares = shares + 3000
WHERE name IN ('KCE')

In [25]:
rp = const.execute(sqlUpd)
rp.rowcount

1

### Update stocks in PortLite

In [28]:
sql = """
SELECT * 
FROM stocks
WHERE name IN (%s) 
ORDER BY name
"""
sql = sql % in_p
df_stocks = pd.read_sql(sql, conlite)
df_stocks

,id,name,max_price,min_price,status,buy_target,sell_target,volume,beta,cost,qty,buy_spread,sell_spread,available_qty,bl,sh,reason,market
0,135,PTTGC,70,54.25,S,0,58.75,1268.88,1.17,66.75,1000,-11,9,4400,3,12,CUT,SET50

In [25]:
new_cost = 66.75
trans_qty, new_cost

(-1000, 66.75)

In [26]:
sqlUpd = """
UPDATE stocks
SET available_qty = available_qty + %s, cost = %s
WHERE name IN (%s)"""
sqlUpd = sqlUpd % (trans_qty, new_cost, in_p)
print(sqlUpd)

UPDATE stocks
SET available_qty = available_qty + -1000, cost = 66.75
WHERE name IN ('PTTGC')

In [27]:
rp = conlite.execute(sqlUpd)
rp.rowcount

1

### Trace bakc process

In [19]:
#grouped.reset_index(level=0, inplace=True)
grouped.reset_index(level='name', inplace=True)
#level=['name', 'etc']
grouped

  name   qty  price       net     cost   profit
0  KCE  1000  91.25  91047.89  87192.7  3855.19

In [20]:
sql = '''
SELECT *
FROM price
WHERE date = '%s'
AND name IN (%s)
'''
sql = sql % (today, in_p)
print(sql)

SELECT *
FROM price
WHERE date = '2021-12-28'
AND name IN ('KCE')

In [21]:
prices = pd.read_sql(sql, const)
prices

Empty DataFrame
Columns: [name, date, price, maxp, minp, qty, opnp]
Index: []

In [22]:
df_merge = pd.merge(grouped, prices, on='name', how='inner')
df_merge.dtypes

name        object
qty_x        int64
price_x    float64
net        float64
cost       float64
profit     float64
date        object
price_y     object
maxp        object
minp        object
qty_y       object
opnp        object
dtype: object

In [23]:
cols = 'name qty_x price_x price_y'.split()
df_merge[cols]

Empty DataFrame
Columns: [name, qty_x, price_x, price_y]
Index: []

In [24]:
df_merge['diff'] = df_merge.price_x - df_merge.price_y
df_merge['profit'] = (df_merge.price_x - df_merge.price_y) * df_merge.qty_x
cols = 'name qty_x price_x price_y diff profit'.split()
df_merge[cols]

Empty DataFrame
Columns: [name, qty_x, price_x, price_y, diff, profit]
Index: []

In [25]:
df_merge.profit.sum()

0

In [26]:
df_merge['diff2'] = df_merge.opnp - df_merge.price_y
df_merge['profit2'] = (df_merge.opnp - df_merge.price_y) * df_merge.qty_x
cols = 'name qty_x opnp price_y diff2 profit2'.split()
df_merge[cols]

Empty DataFrame
Columns: [name, qty_x, opnp, price_y, diff2, profit2]
Index: []

In [27]:
df_merge.profit2.sum()

0